DataProcessors/ПомощникЗаполненияЗаявленияНаПолучениеПатента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПомощникЗаполненияЗаявленияНаПолучениеПатента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеВидаДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомерВидаДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСотрудников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаЗакона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТипаТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Марка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрационныйЗнак</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоподъемность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПомощникЗаполненияЗаявленияНаПолучениеПатента/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если СтавкаНалога = УчетПСНКлиентСервер.НалоговаяСтавкаПоУмолчанию() Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НормаЗакона");
	КонецЕсли;
	
	ИспользуетсяСервисРегистрации = Обработки.РегистрацияОрганизации.ИспользуетсяСервисРегистрации()
		И Константы.НачалоРаботы.Получить();
		
	Если Не ИспользуетсяСервисРегистрации И Лев(КодНалоговогоОргана, 2) <> КодРегиона Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Код инспекции не принадлежит региону регистрации!'"),, "КодНалоговогоОргана", "Объект", Отказ);
	КонецЕсли;
	
	Классификатор =
		Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.КлассификаторВидовПредпринимательскойДеятельностиПСН(
			ДатаНачала);
	
	ВидДеятельности = Классификатор.Найти(КодВидаДеятельности, "Код");
	Если ВидДеятельности = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Неправильно задан вид деятельности!'"),, "КодВидаДеятельности", "Объект", Отказ);
	Иначе
		Если ВидДеятельности.УказатьОбъекты Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ТранспортныеСредства");
			ПроверитьКорректностьВводаАдресов("Объекты", НСтр("ru = 'Сведения об объектах'"), Отказ);
		ИначеЕсли ВидДеятельности.ЭтоПеревозкаГрузов Или ВидДеятельности.ЭтоперевозкаПассажиров Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Объекты");
			Если ВидДеятельности.ЭтоПеревозкаГрузов Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ТранспортныеСредства.Количество");
			Иначе
				МассивНепроверяемыхРеквизитов.Добавить("ТранспортныеСредства.Грузоподъемность");
			КонецЕсли;
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("Объекты");
			МассивНепроверяемыхРеквизитов.Добавить("ТранспортныеСредства");
			ПроверитьКорректностьВводаАдресов("Адреса", НСтр("ru = 'Адреса места осуществления деятельности'"), Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользуетсяСервисРегистрации Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачала");
		
	ИначеЕсли ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		Если ДатаНачала > ДатаОкончания Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Дата окончания не может быть ранее даты начала'"),, "ДатаОкончания", "Объект", Отказ);
		ИначеЕсли Год(ДатаОкончания) <> Год(ДатаНачала) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Срок действия патента может быть только в пределах одного календарного года'"),,
					"ДатаОкончания", "Объект", Отказ);
		Иначе
			МинимальнаяДатаОкончания
				= Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.МинимальнаяДатаОкончанияПатента(ДатаНачала);
			Если ДатаОкончания < МинимальнаяДатаОкончания Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Срок действия патента должен быть не менее одного календарного месяца'"),,
						"ДатаОкончания", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьКорректностьВводаАдресов(ИмяТабличнойЧасти, ИмяРазделаФормы, Отказ)
	
	Если ЭтотОбъект[ИмяТабличнойЧасти].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоОбъекты = ИмяТабличнойЧасти = "Объекты";
	Если ЭтоОбъекты Тогда
		ОбъектыБезАдреса  = Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.ВидыОбъектовБезАдреса();
		ОбъектыБезПлощади = Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.ВидыОбъектовБезПлощади();
	КонецЕсли;
	
	КодНО = "";
	
	ШаблонПоляОшибки = "%1[%2].%3";
	ШаблонАдресНекорректный  = НСтр("ru = 'Указанный адрес не принадлежит региону регистрации %1: строка №%2 списка ""%3""'");
	ШаблонНеЗаполненАдрес    = НСтр("ru = 'Не заполнена колонка ""Адрес"" в строке №%1 списка ""%2""'");
	ШаблонНеЗаполненаПлощадь = НСтр("ru = 'Не заполнена колонка ""Площадь"" в строке №%1 списка ""%2""'");
	
	Если КодВидаДеятельности = Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.ВидДеятельностиТорговляБезТорговогоЗала() Тогда
		ИсключитьПроверкуПлощади = Истина;
	Иначе
		ИсключитьПроверкуПлощади = Ложь;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ЭтотОбъект[ИмяТабличнойЧасти] Цикл
		
		ПустойАдрес = ПустаяСтрока(ТекСтрока.Адрес);
		
		Если Не ПустойАдрес Тогда
			
			НаименованиеРегиона = РаботаСАдресами.РегионАдресаКонтактнойИнформации(ТекСтрока.Адрес);
			ТекСтрокаКодРегиона = АдресныйКлассификатор.КодРегионаПоНаименованию(НаименованиеРегиона);
			Если Число(КодРегиона) <> ТекСтрокаКодРегиона Тогда
				НаименованиеРегионРегистрации = АдресныйКлассификатор.НаименованиеРегионаПоКоду(КодРегиона);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон(ШаблонАдресНекорректный, НаименованиеРегионРегистрации, ТекСтрока.НомерСтроки, ИмяРазделаФормы),,
					СтрШаблон(ШаблонПоляОшибки, ИмяТабличнойЧасти, ТекСтрока.НомерСтроки - 1, "АдресСтрокой"),
					"Объект",
					Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоОбъекты И ПустойАдрес И ОбъектыБезАдреса.НайтиПоЗначению(ТекСтрока.ВидОбъекта) = Неопределено Тогда 
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(ШаблонНеЗаполненАдрес, ТекСтрока.НомерСтроки, ИмяРазделаФормы),,
				СтрШаблон(ШаблонПоляОшибки, ИмяТабличнойЧасти, ТекСтрока.НомерСтроки - 1, "АдресСтрокой"),
				"Объект",
				Отказ);
			
		КонецЕсли;
		
		Если ЭтоОбъекты И ТекСтрока.Площадь = 0
			И ОбъектыБезПлощади.НайтиПоЗначению(ТекСтрока.ВидОбъекта) = Неопределено
			И Не ИсключитьПроверкуПлощади Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(ШаблонНеЗаполненаПлощадь, ТекСтрока.НомерСтроки, ИмяРазделаФормы),,
				СтрШаблон(ШаблонПоляОшибки, ИмяТабличнойЧасти, ТекСтрока.НомерСтроки - 1, "Площадь"),
				"Объект",
				Отказ);
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
